<?xml version="1.0" ?>
<net name="action-recognition-0001-decoder" version="10">
	<layers>
		<layer id="0" name="0" type="Parameter" version="opset1">
			<data element_type="f16" shape="1,16,512"/>
			<output>
				<port id="0" names="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="249935/EltwiseUnsqueeze7240_const480_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1,16,512" size="16384"/>
			<output>
				<port id="0" names="249" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="250" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="250" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="29792983_const" type="Const" version="opset1">
			<data element_type="f16" offset="16384" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="4" name="29802984_const" type="Const" version="opset1">
			<data element_type="f16" offset="16386" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="5" name="29812985_const" type="Const" version="opset1">
			<data element_type="f16" offset="16384" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="6" name="29822986_const" type="Const" version="opset1">
			<data element_type="f16" offset="16386" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="7" name="264/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="263/Output_0/Data__const482_const" type="Const" version="opset1">
			<data element_type="i64" offset="16388" shape="3" size="24"/>
			<output>
				<port id="0" names="263" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="264" type="Tile" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="264" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="267/Unsqueeze/Output_0/Data__const484_const" type="Const" version="opset1">
			<data element_type="i64" offset="16412" shape="1" size="8"/>
			<output>
				<port id="0" names="267" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="268/Unsqueeze/Output_0/Data__const485_const" type="Const" version="opset1">
			<data element_type="i64" offset="16420" shape="1" size="8"/>
			<output>
				<port id="0" names="268" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="261" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" names="261" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="decoder_262937/Cast_16249_const" type="Const" version="opset1">
			<data element_type="i32" offset="16428" shape="" size="4"/>
			<output>
				<port id="0" names="260" precision="I32"/>
			</output>
		</layer>
		<layer id="14" name="decoder_262937/Cast_26251_const" type="Const" version="opset1">
			<data element_type="i64" offset="16432" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="15" name="262937" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" names="262" precision="I64"/>
			</output>
		</layer>
		<layer id="16" name="269/Dims/Output_0/Data__const490_const" type="Const" version="opset1">
			<data element_type="i64" offset="16432" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="269/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="269" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="270" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" names="270" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="271" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="271" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="218/quantized5423_const" type="Const" version="opset1">
			<data element_type="i8" offset="16440" shape="8,64,512" size="262144"/>
			<output>
				<port id="0" precision="I8">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="218/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="decoder_290/fq_weights_1/zero_point5436_const" type="Const" version="opset1">
			<data element_type="f16" offset="278584" shape="8,1,1" size="16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="290/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="decoder_290/fq_weights_1/scale5431_const" type="Const" version="opset1">
			<data element_type="f16" offset="278600" shape="8,1,1" size="16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="290/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="290" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="290" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="30293033_const" type="Const" version="opset1">
			<data element_type="f16" offset="278616" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="28" name="30303034_const" type="Const" version="opset1">
			<data element_type="f16" offset="278618" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="29" name="30313035_const" type="Const" version="opset1">
			<data element_type="f16" offset="278616" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="30" name="30323036_const" type="Const" version="opset1">
			<data element_type="f16" offset="278618" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="31" name="297/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="293/Unsqueeze/Output_0/Data__const496_const" type="Const" version="opset1">
			<data element_type="i64" offset="16420" shape="1" size="8"/>
			<output>
				<port id="0" names="293" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="252" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" names="252" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="decoder_253913/Cast_16217_const" type="Const" version="opset1">
			<data element_type="i32" offset="278620" shape="" size="4"/>
			<output>
				<port id="0" names="251" precision="I32"/>
			</output>
		</layer>
		<layer id="35" name="decoder_253913/Cast_26219_const" type="Const" version="opset1">
			<data element_type="i64" offset="16432" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="36" name="253913" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" names="253" precision="I64"/>
			</output>
		</layer>
		<layer id="37" name="294/Dims/Output_0/Data__const501_const" type="Const" version="opset1">
			<data element_type="i64" offset="16432" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="294/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="294" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="295/Unsqueeze/Output_0/Data__const503_const" type="Const" version="opset1">
			<data element_type="i64" offset="278624" shape="1" size="8"/>
			<output>
				<port id="0" names="295" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="296" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" names="296" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="297" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="297" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="272/Output_0/Data__const506_const" type="Const" version="opset1">
			<data element_type="i64" offset="16388" shape="3" size="24"/>
			<output>
				<port id="0" names="272" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="273" type="Tile" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="273" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="276/Unsqueeze/Output_0/Data__const508_const" type="Const" version="opset1">
			<data element_type="i64" offset="16412" shape="1" size="8"/>
			<output>
				<port id="0" names="276" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="277/Unsqueeze/Output_0/Data__const509_const" type="Const" version="opset1">
			<data element_type="i64" offset="16420" shape="1" size="8"/>
			<output>
				<port id="0" names="277" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="278/Dims/Output_0/Data__const510_const" type="Const" version="opset1">
			<data element_type="i64" offset="16432" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="278/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="278" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="279" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" names="279" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="280" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="280" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="219/quantized5183_const" type="Const" version="opset1">
			<data element_type="i8" offset="278632" shape="8,64,512" size="262144"/>
			<output>
				<port id="0" precision="I8">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="219/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="decoder_298/fq_weights_1/zero_point5196_const" type="Const" version="opset1">
			<data element_type="f16" offset="540776" shape="8,1,1" size="16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="298/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="decoder_298/fq_weights_1/scale5191_const" type="Const" version="opset1">
			<data element_type="f16" offset="540792" shape="8,1,1" size="16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="298/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="298" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="298" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="30493053_const" type="Const" version="opset1">
			<data element_type="f16" offset="540808" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="58" name="30503054_const" type="Const" version="opset1">
			<data element_type="f16" offset="540810" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="59" name="30513055_const" type="Const" version="opset1">
			<data element_type="f16" offset="540808" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="60" name="30523056_const" type="Const" version="opset1">
			<data element_type="f16" offset="540810" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="61" name="305/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="301/Unsqueeze/Output_0/Data__const516_const" type="Const" version="opset1">
			<data element_type="i64" offset="16420" shape="1" size="8"/>
			<output>
				<port id="0" names="301" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="255" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" names="255" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="decoder_256945/Cast_16283_const" type="Const" version="opset1">
			<data element_type="i32" offset="278620" shape="" size="4"/>
			<output>
				<port id="0" names="254" precision="I32"/>
			</output>
		</layer>
		<layer id="65" name="decoder_256945/Cast_26285_const" type="Const" version="opset1">
			<data element_type="i64" offset="16432" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="66" name="256945" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" names="256" precision="I64"/>
			</output>
		</layer>
		<layer id="67" name="302/Dims/Output_0/Data__const521_const" type="Const" version="opset1">
			<data element_type="i64" offset="16432" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="302/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="302" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="303/Unsqueeze/Output_0/Data__const523_const" type="Const" version="opset1">
			<data element_type="i64" offset="278624" shape="1" size="8"/>
			<output>
				<port id="0" names="303" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="304" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" names="304" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="305" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="305" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="decoder_314/Cast_16239_const" type="Const" version="opset1">
			<data element_type="i64" offset="540812" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="314" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="317_copy/const75118385/EltwiseUnsqueeze8392_const5284696/quantized5639_const" type="Const" version="opset1">
			<data element_type="i8" offset="540836" shape="1,64,1" size="64"/>
			<output>
				<port id="0" precision="I8">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="317_copy/const75118385/EltwiseUnsqueeze8392_const5284696/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="decoder_317_copy/fq_input_1/zero_point5652_const" type="Const" version="opset1">
			<data element_type="f16" offset="540900" shape="1,1,1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="317_copy/fq_input_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="decoder_317_copy/fq_input_1/scale5647_const" type="Const" version="opset1">
			<data element_type="f16" offset="540902" shape="1,1,1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="317_copy/fq_input_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="317_copy" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="314" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="19751979_const" type="Const" version="opset1">
			<data element_type="f16" offset="540904" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="82" name="19761980_const" type="Const" version="opset1">
			<data element_type="f16" offset="540906" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="83" name="19771981_const" type="Const" version="opset1">
			<data element_type="f16" offset="540904" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="84" name="19781982_const" type="Const" version="opset1">
			<data element_type="f16" offset="540906" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="85" name="315/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="315" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" names="317" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="319" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="319" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="decoder_320923/Cast_16287_const" type="Const" version="opset1">
			<data element_type="i32" offset="540908" shape="" size="4"/>
			<output>
				<port id="0" names="318" precision="I32"/>
			</output>
		</layer>
		<layer id="89" name="decoder_320923/Cast_26289_const" type="Const" version="opset1">
			<data element_type="i64" offset="16432" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="90" name="320923" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" names="320" precision="I64"/>
			</output>
		</layer>
		<layer id="91" name="322" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="322" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="decoder_323901/Cast_16261_const" type="Const" version="opset1">
			<data element_type="i32" offset="278620" shape="" size="4"/>
			<output>
				<port id="0" names="321" precision="I32"/>
			</output>
		</layer>
		<layer id="93" name="decoder_323901/Cast_26263_const" type="Const" version="opset1">
			<data element_type="i64" offset="16432" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="94" name="323901" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" names="323" precision="I64"/>
			</output>
		</layer>
		<layer id="95" name="324" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0"/>
				<port id="1"/>
			</input>
			<output>
				<port id="2" names="324" precision="I64"/>
			</output>
		</layer>
		<layer id="96" name="326/Dims/Output_0/Data__const540_const" type="Const" version="opset1">
			<data element_type="i64" offset="16432" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="326/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="326" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="327/Unsqueeze/Output_0/Data__const542_const" type="Const" version="opset1">
			<data element_type="i64" offset="16420" shape="1" size="8"/>
			<output>
				<port id="0" names="327" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="328" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="328" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="329" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="329" precision="FP16">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="330/FlattenONNX_/Reshape/Cast_115978_const545_const" type="Const" version="opset1">
			<data element_type="i64" offset="540912" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="330/FlattenONNX_/Reshape" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="330/Softmax_" type="SoftMax" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="30693073_const" type="Const" version="opset1">
			<data element_type="f16" offset="540928" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="105" name="30703074_const" type="Const" version="opset1">
			<data element_type="f16" offset="540930" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="106" name="30713075_const" type="Const" version="opset1">
			<data element_type="f16" offset="540928" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="107" name="30723076_const" type="Const" version="opset1">
			<data element_type="f16" offset="540930" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="108" name="330/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="330/ShapeOf_" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="330" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="330" precision="FP16">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="332/Dims/Output_0/Data__const550_const" type="Const" version="opset1">
			<data element_type="i64" offset="16432" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="332/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="332" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="333/Dims/Output_0/Data__const552_const" type="Const" version="opset1">
			<data element_type="i64" offset="16432" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="333/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="333" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="334/Unsqueeze/Output_0/Data__const554_const" type="Const" version="opset1">
			<data element_type="i64" offset="16420" shape="1" size="8"/>
			<output>
				<port id="0" names="334" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="335" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" names="335" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="336" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="337,336" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="281/Output_0/Data__const557_const" type="Const" version="opset1">
			<data element_type="i64" offset="16388" shape="3" size="24"/>
			<output>
				<port id="0" names="281" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="282" type="Tile" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="282" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="285/Unsqueeze/Output_0/Data__const559_const" type="Const" version="opset1">
			<data element_type="i64" offset="16412" shape="1" size="8"/>
			<output>
				<port id="0" names="285" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="286/Unsqueeze/Output_0/Data__const560_const" type="Const" version="opset1">
			<data element_type="i64" offset="16420" shape="1" size="8"/>
			<output>
				<port id="0" names="286" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="287/Dims/Output_0/Data__const561_const" type="Const" version="opset1">
			<data element_type="i64" offset="16432" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="287/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="287" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="288" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" names="288" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="289" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="289" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="220/quantized5615_const" type="Const" version="opset1">
			<data element_type="i8" offset="540932" shape="8,64,512" size="262144"/>
			<output>
				<port id="0" precision="I8">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="220/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="decoder_306/fq_weights_1/zero_point5628_const" type="Const" version="opset1">
			<data element_type="f16" offset="803076" shape="8,1,1" size="16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="306/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="decoder_306/fq_weights_1/scale5623_const" type="Const" version="opset1">
			<data element_type="f16" offset="803092" shape="8,1,1" size="16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="306/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="306" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="306" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="30793083_const" type="Const" version="opset1">
			<data element_type="f16" offset="803108" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="134" name="30803084_const" type="Const" version="opset1">
			<data element_type="f16" offset="803110" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="135" name="30813085_const" type="Const" version="opset1">
			<data element_type="f16" offset="803108" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="136" name="30823086_const" type="Const" version="opset1">
			<data element_type="f16" offset="803110" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="137" name="313/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="309/Unsqueeze/Output_0/Data__const567_const" type="Const" version="opset1">
			<data element_type="i64" offset="16420" shape="1" size="8"/>
			<output>
				<port id="0" names="309" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="258" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" names="258" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="decoder_259947/Cast_16229_const" type="Const" version="opset1">
			<data element_type="i32" offset="278620" shape="" size="4"/>
			<output>
				<port id="0" names="257" precision="I32"/>
			</output>
		</layer>
		<layer id="141" name="decoder_259947/Cast_26231_const" type="Const" version="opset1">
			<data element_type="i64" offset="16432" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="142" name="259947" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" names="259" precision="I64"/>
			</output>
		</layer>
		<layer id="143" name="310/Dims/Output_0/Data__const572_const" type="Const" version="opset1">
			<data element_type="i64" offset="16432" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="144" name="310/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="310" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="145" name="311/Unsqueeze/Output_0/Data__const574_const" type="Const" version="opset1">
			<data element_type="i64" offset="278624" shape="1" size="8"/>
			<output>
				<port id="0" names="311" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="146" name="312" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" names="312" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="147" name="313" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="313" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="148" name="339" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" names="339" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="149" name="31093113_const" type="Const" version="opset1">
			<data element_type="f16" offset="803112" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="150" name="31103114_const" type="Const" version="opset1">
			<data element_type="f16" offset="803114" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="151" name="31113115_const" type="Const" version="opset1">
			<data element_type="f16" offset="803112" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="152" name="31123116_const" type="Const" version="opset1">
			<data element_type="f16" offset="803114" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="153" name="341/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="154" name="341/Cast_116090_const578_const" type="Const" version="opset1">
			<data element_type="i64" offset="803116" shape="4" size="32"/>
			<output>
				<port id="0" names="340" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="155" name="341" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="341" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="156" name="decoder_342/Cast_16303_const" type="Const" version="opset1">
			<data element_type="i64" offset="803148" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="157" name="342" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="342" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="158" name="344/Cast_115980_const582_const" type="Const" version="opset1">
			<data element_type="i64" offset="803180" shape="3" size="24"/>
			<output>
				<port id="0" names="343" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="159" name="344" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="345,344" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="160" name="347" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="347" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="161" name="31193123_const" type="Const" version="opset1">
			<data element_type="f16" offset="803204" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="162" name="31203124_const" type="Const" version="opset1">
			<data element_type="f16" offset="803206" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="163" name="31213125_const" type="Const" version="opset1">
			<data element_type="f16" offset="803204" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="164" name="31223126_const" type="Const" version="opset1">
			<data element_type="f16" offset="803206" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
